---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.Transparency
source: html/9f1d805b-419f-5b60-581f-4b0879df4df4.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.Transparency Property

Transparency percentage of colored surface

## Syntax (C#)
```csharp
public int Transparency { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: transparency is less than 0 or greater than 100